serz/soap

{"Fri Apr 10 15:39:56 MSK 2015":{"requestArea":"<?xml version=\"1.0\" encoding=\"UTF-8\" ?>\n<s12:Envelope xmlns:s12='http://www.w3.org/2003/05/soap-envelope'>\n  <s12:Body>\n    <ns1:GetWeather xmlns:ns1='http://www.webserviceX.NET'>\n      <ns1:CityName>paramValue</ns1:CityName>\n      <ns1:CountryName>paramValue</ns1:CountryName>\n    </ns1:GetWeather>\n  </s12:Body>\n</s12:Envelope>","requestUrlField":"http://www.webservicex.com/globalweather.asmx","projectNameField":"http://www.webservicex.com/globalweather.asmx","responseArea":"<?xml version=\"1.0\" encoding=\"UTF-8\"?><soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><GetWeatherResponse xmlns=\"http://www.webserviceX.NET\"><GetWeatherResult>Data Not Found</GetWeatherResult></GetWeatherResponse></soap:Body></soap:Envelope>","wsdlField":"http://www.webservicex.com/globalweather.asmx?wsdl"}}